codeigniter-FW/app/Models/questionModel.php

    public function getQuestion($id)
    {
        return $this->where(['ID_Q'=>$id])->findColumn('Libelle');
---
SELECT *
FROM `question`
WHERE `ID_Q` = '3'
 LIMIT 1