codeigniter-FW/app/Models/quizzProfModel.php

    public function getTeacher($answers){

        $index = 0;
        $max = 0;
        $id_prof = 0;

        $query = $this->orderBy('ID_prof','ASC')->findAll();
---
SELECT *
FROM `quizz_Prof`
ORDER BY `ID_prof` ASC