codeigniter-FW/app/Models/quizzInternauteModel.php

  public function getAnInternauteQuizzByQuestion($identifiant,$id_q)
  {
    $id_ident=$this->getId_ident($identifiant);

    $rep=$this->join('reponse','reponse.ID_rep = quizz_Internaute.ID_rep')
    ->where(['quizz_Internaute.ID_ident' => $id_ident,'reponse.ID_Q' => $id_q])
    ->first();

    if($rep)
    {
      $id_rep=$rep['ID_rep'];
    }

    else
    {
      $id_rep=0;
    }


    return $this->where(['ID_ident'=>$id_ident, 'ID_rep'=>$id_rep])->first();
---
SELECT *
FROM `quizz_Internaute`
JOIN `reponse` ON `reponse`.`ID_rep` = `quizz_Internaute`.`ID_rep`
WHERE `quizz_Internaute`.`ID_ident` = ('3')
AND `reponse`.`ID_Q` = '1'
 LIMIT 1
SELECT *
FROM `quizz_Internaute`
WHERE `ID_ident` = ('3')
AND `ID_rep` = '5'
 LIMIT 1

  public function getAllInternauteQuizz($identifiant)
  {
    $id_ident=$this->getId_ident($identifiant);
    return $this->where(['ID_ident' => $id_ident])->findAll();
---
SELECT *
FROM `quizz_Internaute`
WHERE `ID_ident` = ('3')

  public function deleteInternauteResponse($identifiant,$id_rep)
  {
    $id_ident=$this->getId_ident($identifiant);
    $this->where(['ID_ident' => $id_ident,'ID_rep' => $id_rep])->delete();
---
DELETE FROM `quizz_Internaute`
WHERE `ID_ident` = ('3')
AND `ID_rep` = '5'

  public function createQuizzInternaute($identifiant,$id_rep)
  {
    $repModel=model(reponseModel::class);
    $id_q=$repModel->where(['reponse.ID_rep'=>$id_rep])->first()['ID_Q'];

    $previousResponse=$this->getAnInternauteQuizzByQuestion($identifiant,$id_q);

    if ($previousResponse)
    {
      $idPreviousResponse=$previousResponse['ID_rep'];
      //écrase la réponse précédente
      $this->deleteInternauteResponse($identifiant,$idPreviousResponse);
    }

    $id_ident=$this->getId_ident($identifiant);

    $data=[
    'ID_ident'=>$id_ident,
    'ID_rep'=>$id_rep
    ];

    $this->insert($data);
---
SELECT *
FROM `reponse`
WHERE `reponse`.`ID_rep` = ('69')
 LIMIT 1
INSERT INTO `quizz_Internaute` (`ID_ident`, `ID_rep`) VALUES (('3'), ('69'))