codeigniter-FW/app/Models/reponseModel.php

    public function getAnswers(){

        $session = \Config\Services::session();
        $id = $session->get('id');


        $builder = $this->select('*');
        $builder->where('ID_Q', $id);
        $query = $builder->get();
---
SELECT *
FROM `reponse`
WHERE `ID_Q` = '5'