codeigniter-FW/app/Models/reponseModel.php

INSERT INTO `reponse` (`Libelle`, `Photo`, `ID_Q`) VALUES ('La chocolatine', ' ', '7')
---
    public function newResponse($libelle, $photo, $id_q){
        $data=[
            'Libelle' => $libelle,
            'Photo' => $photo,
            'ID_Q' => $id_q
        ];
        return $this->insert_id($data);