codeigniter-FW/app/Models/teacherModel.php

SELECT *
FROM `prof`
WHERE `Id_prof` = '16'
 LIMIT 1
---
    public function getById($id)
    {
        return $this->where(['Id_prof' => $id])->first();